1. 모듈 로딩

In [1]:
import pandas as pd
import numpy as np

2. 딕셔너리에서 DataFrame 생성

In [20]:
city_data={ "City" : ["New york city","Paris","Barcelona","Rome"], "Country" : ["United States","France","Spain","Italy"], "Population":pd.Series([8600000,2141000,5515000,2873000])}
cities = pd.DataFrame(city_data)
cities

            City        Country  Population
0  New york city  United States     8600000
1          Paris         France     2141000
2      Barcelona          Spain     5515000
3           Rome          Italy     2873000

3. 열 헤더를 인덱스 레이블로 바꾸기

In [21]:
cities.transpose()
cities.T

                        0        1          2        3
City        New york city    Paris  Barcelona     Rome
Country     United States   France      Spain    Italy
Population        8600000  2141000    5515000  2873000

4. 넘파이 ndarray로 DataFrame 생성

In [2]:
random_data = np.random.randint(1,101,[3,5])
random_data

array([[43, 77, 48, 61, 83],
       [88, 76, 32, 18, 24],
       [83, 61, 49, 77,  1]])

In [3]:
pd.DataFrame(data=random_data)

    0   1   2   3   4
0  43  77  48  61  83
1  88  76  32  18  24
2  83  61  49  77   1

In [4]:
row_labels = ["Morning","Afternoon","EVening"]
temperatures=pd.DataFrame(data=random_data,index=row_labels)
temperatures

            0   1   2   3   4
Morning    43  77  48  61  83
Afternoon  88  76  32  18  24
EVening    83  61  49  77   1

In [5]:
row_labels=["Morning", "Afternoon", "Evening"]
column_lables=("Monday", "Tuesday","Wednesday","Thursday","Friday")
pd.DataFrame(data=random_data, index=row_labels,columns=column_lables,)

           Monday  Tuesday  Wednesday  Thursday  Friday
Morning        43       77         48        61      83
Afternoon      88       76         32        18      24
Evening        83       61         49        77       1